-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- 主機: 127.0.0.1
-- 產生時間： 2018-09-28 18:58:45
-- 伺服器版本: 5.6.17-log
-- PHP 版本： 5.6.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `imdr_gps`
--

-- --------------------------------------------------------

--
-- 資料表結構 `gk`
--

CREATE TABLE `gk` (
  `id` int(11) NOT NULL,
  `lat` float(10,6) NOT NULL,
  `lng` float(10,6) NOT NULL,
  `time` varchar(20) CHARACTER SET utf8 NOT NULL,
  `age` int(2) NOT NULL,
  `email` varchar(50) CHARACTER SET utf8 NOT NULL,
  `message` text CHARACTER SET utf8 NOT NULL,
  `pic` text CHARACTER SET utf8,
  `language` varchar(10) CHARACTER SET utf8 DEFAULT NULL,
  `state` varchar(10) CHARACTER SET utf8 DEFAULT NULL,
  `ip` varchar(15) CHARACTER SET utf8 DEFAULT NULL,
  `qrcode` text CHARACTER SET utf8
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

--
-- 資料表的匯出資料 `gk`
--

INSERT INTO `gk` (`id`, `lat`, `lng`, `time`, `age`, `email`, `message`, `pic`, `language`, `state`, `ip`, `qrcode`) VALUES
(116, 24.286945, 120.683090, '2018-01-21 05:06:13', 23, 'SAS@gmail.com', 'Hello DDD DASDZXDASDSADSADASDASDASD Hello DDD DASDZXDASDSADSADASDASDASD Hello DDD DASDZXDASDSADSADDSADASDASDASDASDASDASDASDASDASDASDASDASDSADSADASDASDASD', '2018012117061341.jpg', 'EN', 'AF', NULL, '1'),
(117, 54.157314, 120.683258, '2018-01-22 05:57:13', 87, '123@123.com', '你好', '2018012205571325.png', 'ES', 'TW', NULL, 'gk'),
(118, 24.168402, 120.650826, '2018-01-22 06:03:58', 0, 'JOIJO@MOSNDOA.nn', '????????', '2018012206035828.png', 'EN', 'ES', NULL, '1'),
(119, 34.157314, 120.683258, '2018-01-22 06:07:45', 100, 'aaa@aaa.cc', '????????', '2018012206074531.jpg', 'EN', 'AI', NULL, 'gk'),
(120, 24.157318, 120.683258, '2018-01-22 06:10:33', 12, '34@56.78', '????????', '201801220610331.png', 'EN', 'AF', NULL, 'gk'),
(122, 24.157316, 120.683258, '2018-01-24 12:27:44', 98, '54@32.21', '00嫩', '2018012400274449.jpg', 'zh-TW', 'TW', NULL, 'gk'),
(123, 23.697880, 120.533653, '2018-01-25 12:19:11', 65, '123@123.com', '守德', '2018012500191172.jpg', 'TW', 'TW', NULL, 'gk'),
(124, 23.964186, 120.603622, '2018-01-25 04:33:20', 78, 'idiot@idiot.com', '安安我可以打中文\r\n猛吧', '2018012504332022.jpg', 'EN', 'BS', NULL, '1'),
(125, 0.000000, 0.000000, '2018-01-25 04:40:19', 65, 'coco8@80.91', '65354345', '2018012504401938.jpg', 'EN', 'AS', NULL, 'gk'),
(126, 24.157316, 120.683258, '2018-01-25 06:04:29', 56, '43@11.11', '28', '2018012506042966.png', 'TW', 'AG', '::1', 'gk'),
(127, 23.697880, 120.533653, '2018-01-25 06:06:30', 82, 'da@fa.cc', 'dasd', '2018012506063077.jpg', 'TW', 'GE', '140.125.155.199', 'gk'),
(128, 0.000000, 0.000000, '2018-01-27 12:22:38', 33, '33@33.33', '33嫩', '201801270022384.jpeg', 'TW', 'AS', '172.68.253.244', 'gk'),
(177, 0.000000, 0.000000, '2018-03-16 11:20:16', 66666, '66@66.66', '6', '2018012206035828.png', 'TW', 'AF', '127.0.0.1', '1'),
(130, 0.000000, 0.000000, '2018-01-27 10:59:15', 88, '88@88.88', '88', '2018012710591528.jpeg', 'TW', 'BH', '172.68.253.244', 'gk'),
(131, 0.000000, 0.000000, '2018-01-27 02:29:16', 0, 'Oo@oo.oo', 'Hi', '2018012714291645.jpeg', 'TW', 'AX', '172.68.253.244', 'gk'),
(132, 23.677900, 120.392738, '2018-01-27 02:34:34', 66, '66@66.66', '666666嫩', '2018012714343470.jpeg', 'TW', 'CF', '172.68.253.244', 'gk'),
(133, 23.698954, 120.538338, '2018-01-27 09:00:25', 23, 'caturkey123@gmail.com', '嗷嗷嗷', '2018012721002534.jpg', 'TW', 'TW', '162.158.58.116', 'gk'),
(134, 0.000000, 0.000000, '2018-01-27 09:02:14', 12, 'Ggyy7788@33.99', 'I’m handsome ', '', 'TW', 'TW', '172.68.211.171', 'gk'),
(135, 0.000000, 0.000000, '2018-01-27 09:02:17', 12, 'Ggyy7788@33.99', 'I’m handsome ', '', 'TW', 'TW', '172.68.211.171', 'gk'),
(136, 0.000000, 0.000000, '2018-01-27 09:02:19', 12, 'Ggyy7788@33.99', 'I’m handsome ', '', 'TW', 'TW', '172.68.211.171', 'gk'),
(137, 0.000000, 0.000000, '2018-01-27 09:02:20', 12, 'Ggyy7788@33.99', 'I’m handsome ', '', 'TW', 'TW', '172.68.211.171', 'gk'),
(138, 0.000000, 0.000000, '2018-01-27 09:02:50', 23, 's1021981@gm.pu.edu.tw', 'Kiwi', '', 'TW', 'AF', '172.68.253.244', 'gk'),
(139, 0.000000, 0.000000, '2018-01-27 09:05:51', 23, 'crazy831116@gmail.com', '貓貓', '2018012721055189.png', 'TW', 'AF', '162.158.58.116', 'gk'),
(140, 0.000000, 0.000000, '2018-01-27 09:06:05', 23, 'crazy831116@gmail.com', '貓貓', '2018012721060569.png', 'TW', 'AF', '162.158.58.116', 'gk'),
(141, 23.678005, 120.392525, '2018-01-28 09:02:06', 55, '55@55.com', '55', '2018012809020610.jpeg', 'TW', 'BR', '172.68.253.244', 'gk'),
(142, 0.000000, 0.000000, '2018-01-28 09:09:48', 18, 'Judy606350@gmail.com', 'No', '', 'TW', 'AU', '172.68.255.61', 'gk'),
(143, 0.000000, 0.000000, '2018-02-14 01:46:57', 11, '11@11.11', '11', '2018021401465738.jpg', 'TW', 'AF', '172.68.211.165', 'gk'),
(144, 0.000000, 0.000000, '2018-02-28 03:16:19', 99, '99@99.99', '99', '2018022803161948.png', 'TW', 'AF', '108.162.215.231', 'gk'),
(145, 23.656721, 120.312660, '2018-02-28 08:30:48', 88, '88@88.88', '88', '201802282030488.png', 'TW', 'AQ', '108.162.215.231', 'gk'),
(147, 23.707678, 120.562447, '2018-02-28 10:07:12', 123, '123@123.123', '123', '2018022822071239.png', 'TW', 'AF', '108.162.215.231', 'gk'),
(148, 23.707678, 120.562447, '2018-02-28 10:12:56', 87, '87@87.87', '87', '2018022822125647.png', 'TW', 'AF', '108.162.215.231', 'gk'),
(149, 23.716789, 120.459534, '2018-02-28 10:31:55', 20, 'jjjjjjj@yopmail.com', 'asd', '2018022822315575.jpg', 'TW', 'AF', '127.0.0.1', '1'),
(150, 23.438309, 120.344086, '2018-02-28 10:33:51', 20, 'jjjjjjj@yopmail.com', 'asd', '2018012504332022.jpg', 'TW', 'AF', '127.0.0.1', '1'),
(151, 0.000000, 0.000000, '2018-02-28 10:45:45', 20, 'jjjjjjj@yopmail.com', 'fdsdf', '2018022822454558.jpg', 'TW', 'AO', '127.0.0.1', 'gk'),
(178, 0.000000, 0.000000, '2018-03-17 03:02:27', 77, '77@77.77', '7', '2018012206035828.png', 'TW', 'AF', '127.0.0.1', '1'),
(179, 23.193069, 120.197731, '2018-03-21 09:06:14', 1213, 'rerwe@yrjjlfjsl.com', 'ああああああああ', '2018030522582371.jpg', 'TW', 'TW', '172.68.47.123', '1'),
(155, 0.000000, 0.000000, '2018-03-01 12:13:14', 31, '31@31.31', '好難搞啊啊啊啊啊啊', '2018030100131448.png', 'TW', 'BY', '172.68.253.82', '13'),
(156, 23.707678, 120.562447, '2018-03-01 12:28:25', 87, '87@87.87', '你真的超胖', '2018030100282545.png', 'TW', 'AF', '108.162.215.231', '???'),
(157, 23.707678, 120.562447, '2018-03-01 12:30:26', 87, '87@87.87', '你真的超胖', '', 'TW', 'AF', '108.162.215.231', '???'),
(158, 23.707678, 120.562447, '2018-03-01 12:31:58', 87, '87@87.87', '你真的超胖沒騙你', '2018030100315894.png', 'TW', 'AF', '108.162.215.231', '???'),
(159, 23.707678, 120.562447, '2018-03-01 12:33:27', 87, '87@87.87', '你真的超胖沒騙你', '2018030100332744.png', 'TW', 'AF', '108.162.215.231', '你超胖'),
(160, 23.707678, 120.562447, '2018-03-01 11:39:16', 26, '26@26.26', '守德', '2018030111391664.png', 'TW', 'TW', '162.158.59.81', '66'),
(161, 23.445038, 120.477989, '2018-03-01 08:18:56', 88, '88@88.88', '88', '2018030120185621.jpeg', 'TW', 'AF', '172.68.253.82', '17'),
(175, 24.397566, 120.678230, '', 0, '', '', '2018012504332022.jpg', NULL, NULL, NULL, '1'),
(176, 24.952353, 121.256454, '', 0, '', '', '2018022822335196.jpg', NULL, NULL, NULL, '1'),
(170, 23.707678, 120.562447, '2018-03-03 08:35:48', 0, '', '', NULL, 'MATH', NULL, '108.162.215.165', 'math'),
(171, 23.707678, 120.562447, '2018-03-03 08:36:14', 0, '', '', NULL, 'MATH', NULL, '108.162.215.165', 'math'),
(172, 25.126095, 121.502373, '2018-03-05 10:52:28', 18, 's1021982@gm.pu.edu.tw', '我今年18歲', '2018012206035828.png', 'TW', 'AF', '172.68.47.101', '1'),
(173, 0.000000, 0.000000, '2018-03-05 10:54:58', 16, 'lazywolfmax@gmail.com', '嗷嗷嗷嗷', '2018030522545812.jpg', 'TW', 'AF', '172.68.254.83', '1'),
(174, 23.676952, 120.469078, '2018-03-05 10:58:23', 16, 'lazywolfmax@gmail.com', '嗷嗷嗷嗷', '2018030522582371.jpg', 'TW', 'AF', '172.68.254.83', '1'),
(180, 24.184820, 120.631493, '2018-04-16 02:34:06', 99, '99@99.999', '99999', '2018041602340677.png', 'ES', 'AU', '172.68.46.242', 'gk'),
(181, 24.184820, 120.631493, '2018-04-16 02:38:01', 33, '33@33.33', '333', '2018041602380153.jpg', 'EN', 'AF', '172.68.46.242', '1'),
(182, 24.184820, 120.631493, '2018-04-16 02:39:16', 87, '87@87.87', '@Q@', '2018041602391674.png', 'ES', 'AF', '172.68.46.242', 'gk'),
(183, 0.000000, 0.000000, '2018-04-18 12:39:46', 0, '', '', '', 'TW', 'AF', '172.68.46.242', 'gk'),
(184, 23.707678, 120.562447, '2018-04-18 06:56:24', 123, '123@123.123', '淳禎不跟我們吃飯', '2018041818562437.png', 'TW', 'AF', '162.158.58.60', '1'),
(185, 23.707678, 120.562447, '2018-04-23 02:01:30', 23, 'Icery@IceryOfficial.com', '我被侵犯了', '2018042302013058.png', 'TW', 'TW', '162.158.59.217', 'gk'),
(186, 24.184820, 120.631493, '2018-04-23 10:06:35', 56, '65@65.54', '12312312313', '2018042322063546.png', 'TW', 'AO', '108.162.215.217', '1'),
(187, 24.184820, 120.631493, '2018-04-23 10:09:26', 56, '65@65.54', '12312312313', '2018042322092657.png', 'TW', 'AO', '108.162.215.217', '1'),
(188, 24.184820, 120.631493, '2018-04-23 10:33:13', 25, 'jjjjjjj@yopmail.com', 'dsf', '', 'TW', 'AF', '108.162.215.217', '1'),
(189, 24.184820, 120.631493, '2018-04-23 10:33:55', 156, '646@46513.456', 'sdasdasd', '2018042322335515.png', 'TW', 'AF', '108.162.215.217', '1'),
(190, 0.000000, 0.000000, '2018-04-23 10:34:20', 20, 'jjjjjjj@yopmail.com', 'dfs', '', 'TW', 'AF', '108.162.215.217', '1'),
(191, 0.000000, 0.000000, '2018-04-23 10:57:33', 87, '78@1313.465', 'adasdasda', '2018042322573352.jpg', 'TW', 'TW', '108.162.215.217', '1'),
(192, 0.000000, 0.000000, '2018-04-23 11:00:17', 1, '1@11.11', '11', '2018042323001743.jpg', 'TW', 'AL', '108.162.215.217', '1'),
(193, 24.184820, 120.631493, '2018-04-23 11:03:11', 22, '22@22.22', '222', '2018042323031131.jpg', 'TW', 'SI', '108.162.215.217', '1'),
(194, 24.184820, 120.631493, '2018-04-24 12:34:53', 22, '22@22.22', '222', '2018042400345345.jpg', 'TW', 'SI', '108.162.215.217', '1'),
(195, 23.690187, 120.534302, '2018-04-24 12:37:01', 22, 'erere@yahoo.com.tw', '<3', '', 'TW', 'TW', '172.68.255.5', '1'),
(196, 24.030403, 120.481857, '2018-04-29 10:00:09', 18, 'sfa@sbfs.ggg.gg', '測試照片', '', 'TW', 'AF', '162.158.58.150', '1'),
(197, 24.184820, 120.631493, '2018-04-30 12:59:04', 87, '87@87.87', '87', '201804300059042.png', 'TW', 'TW', '108.162.215.217', '1'),
(198, 23.703119, 120.360832, '2018-04-30 04:46:20', 23, 'Icery@IceryOfficial.com', '今天遇到色狼，所以報警了，我知道維護治安人人有責，不客氣。', '2018043004462034.png', 'TW', 'TW', '172.68.46.164', 'testrun01'),
(199, 24.030394, 120.481903, '2018-04-30 10:47:43', 18, '244@rhrh2.tw', 'rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr', '', 'TW', 'AF', '162.158.58.150', '1'),
(200, 24.030394, 120.481903, '2018-04-30 10:54:26', 18, 'aaa@dgsg.tw', ']XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX]XXXXXXXXX', '2018043010542650.jpg', 'TW', 'AF', '162.158.58.150', '1'),
(201, 23.697315, 120.533653, '2018-04-30 03:05:21', 23, 'Icery@IceryOfficial.com', '代碼遺下就可以了', '2018043015052112.PNG', 'TW', 'TW', '162.158.58.102', '1'),
(202, 23.703367, 120.547653, '2018-05-01 09:51:17', 32, 'yichun7543@gmail.com', 'Test', '', 'TW', 'TW', '162.158.179.49', 'testrun01'),
(203, 23.691990, 120.535606, '2018-05-01 11:35:19', 24, 'd35026761027@gmail.com', '今天來到創新媒體實驗室，藉由守德的導讀巴巴納克的為真實世界設計，對於設計教育的問題更進一步釐清，還準備教材用心程度滿分，接下來的西班牙文也收穫滿滿，謝謝創新媒體實驗室帶給我知性和靈性的充實！', '2018050111351933.jpg', 'TW', 'TW', '162.158.58.102', '0028'),
(204, 23.692623, 120.535576, '2018-05-01 11:45:29', 23, 's1021982@gm.pu.edu.tw', '\r\n幫助迷路的我找到設計三科', '2018050111452969.jpg', 'TW', 'AF', '172.68.211.37', '0012'),
(205, 23.692623, 120.535576, '2018-05-01 11:45:32', 23, 's1021982@gm.pu.edu.tw', '\r\n幫助迷路的我找到設計三科', '2018050111453220.jpg', 'TW', 'AF', '172.68.211.37', '0012'),
(206, 23.692623, 120.535576, '2018-05-01 11:45:35', 23, 's1021982@gm.pu.edu.tw', '\r\n幫助迷路的我找到設計三科', '2018050111453518.jpg', 'TW', 'AF', '172.68.211.37', '0012'),
(207, 23.718702, 120.561729, '2018-05-01 01:45:31', 24, 'Icery@IceryOfficial.com', '阿囧穿花襯衫', '2018050113453176.jpg', 'TW', 'TW', '172.68.254.87', 'testrun01'),
(208, 23.707678, 120.562447, '2018-05-02 12:30:12', 25, 'zhen10427@hotmail.com', 'hahaha', '2018050200301250.JPG', 'TW', 'TW', '162.158.58.102', 'testrun01'),
(209, 0.000000, 0.000000, '2018-05-05 12:33:22', 23, 'guanyilovepooh@gmail.com', '和蕙心&其他大學室友一起到澎湖渡假', '', 'TW', 'TW', '162.158.59.85', '0021'),
(210, 0.000000, 0.000000, '2018-05-05 12:35:01', 23, 'guanyilovepooh@gmail.com', '和心心&其他室友一起來澎湖渡假', '', 'TW', 'TW', '162.158.59.85', '0021'),
(211, 0.000000, 0.000000, '2018-05-05 12:36:12', 23, 'sandy84413@gmail.com', '和蕙心一起分享生活～', '2018050512361254.JPG', 'TW', 'AF', '172.68.253.68', '0018'),
(212, 23.707678, 120.562447, '2018-05-05 12:46:36', 23, '123@132.123', 'Hello', '2018050512463685.jpg', 'TW', 'TW', '172.68.47.153', 'testrun01'),
(213, 23.692551, 120.535553, '2018-05-05 10:02:09', 26, 'zhen10427@hotmail.com', '這是我喝過最美麗的飲料了!\r\n感謝推薦我的人，如久旱逢甘霖', '2018050522020986.PNG', 'TW', 'TW', '162.158.59.79', '1'),
(214, 23.707678, 120.562447, '2018-05-06 03:33:15', 23, 's1021982@gm.pu.edu.tw', '為什麼我在巧克力工廠附近?', '', 'TW', 'AF', '162.158.58.192', '1'),
(215, 23.707678, 120.562447, '2018-05-07 02:48:48', 23, 's1021982@gm.pu.edu.tw', 'S', '2018050702484851.jpg', 'TW', 'AF', '162.158.58.102', '1'),
(216, 23.692404, 120.535179, '2018-05-07 08:41:17', 23, 's1021982@gm.pu.edu.tw', 'hi', '', 'EN', 'AF', '162.158.58.102', '1'),
(217, 23.692610, 120.535576, '2018-05-08 10:02:20', 23, 'erinlin6699889@yahoo.com.tw', '今天同學請我吃了好多好多蛋糕和茶，即使最近因為課業和產學的事情覺得身心疲憊，但因為蛋糕和好喝的綠茶，今天感受到了微微的幸福~', '2018050822022020.JPG', 'TW', 'TW', '172.68.46.8', '0031'),
(218, 23.707678, 120.562447, '2018-05-11 05:37:48', 57, 'b831003ge@gmail.com', '1.123.0', '', 'TW', 'AS', '162.158.224.49', ''),
(219, 0.000000, 0.000000, '2018-05-15 04:09:02', 27, 'zhen10427@hotmail.com', '今天踏出了 拓展人生的第一步', '201805151609022.jpg', 'TW', 'TW', '162.158.58.102', '0020'),
(236, 0.000000, 0.000000, '2018-05-16 12:39:46', 18, 'Cltsai@yuntech.edu.tw', 'Very happy to attend this project ', '2018051612394633.jpg', 'TW', 'TW', '162.158.59.187', '0002'),
(237, 0.000000, 0.000000, '2018-05-16 12:44:52', 55, 'yuhy@yuntech.edu.tw', '趙琪老師送給我', '201805161244520.jpg', 'TW', 'TW', '162.158.58.66', '0036'),
(238, 0.000000, 0.000000, '2018-05-16 01:00:59', 45, 'leeyun0211@gmail.com', '參與傳善計劃，感受世界的幸福與美好❤', '', 'TW', 'TW', '162.158.58.198', '0001'),
(222, 0.000000, 0.000000, '2018-05-15 04:11:34', 27, 'zhen10427@hotmail.com', 'Wwwww', '2018051516113411.jpg', 'TW', 'AF', '162.158.58.102', '0020'),
(239, 23.693933, 120.532753, '2018-05-16 01:16:58', 54, 'Yangjs@yuntech.edu.tw', '今天，我的同仁幫我找一個緊急資料，很感謝他。', '2018051613165857.jpeg', 'TW', 'TW', '162.158.59.79', '0047'),
(240, 0.000000, 0.000000, '2018-05-16 03:59:29', 29, 'pchchou@gmail.com', '今天趙琪老師給了我很有意義的硬幣', '2018051615592924.jpeg', 'TW', 'TW', '162.158.178.66', '0057'),
(225, 0.000000, 0.000000, '2018-05-15 04:38:19', 27, 'zhen10427@hotmail.com', '友善的傳遞', '2018051516381961.jpg', 'TW', 'TW', '162.158.59.79', '0020'),
(226, 0.000000, 0.000000, '2018-05-15 04:38:24', 27, 'zhen10427@hotmail.com', '友善的傳遞', '2018051516382425.jpg', 'TW', 'TW', '162.158.59.79', '0020'),
(241, 0.000000, 0.000000, '2018-05-16 04:29:21', 23, 'chanyusum14@gmail.com', '今天趙老師在工作時跟我聊天，工作變得愉快', '2018051616292117.jpg', 'TW', 'HK', '172.68.255.41', '0012'),
(228, 23.707678, 120.562447, '2018-05-15 04:40:01', 12, '12@12.12', '12', '2018051516400147.png', 'TW', 'AD', '173.245.48.90', '1'),
(229, 23.707678, 120.562447, '2018-05-15 04:44:49', 12, '12@12.12', '12', '2018051516444996.png', 'TW', 'AF', '173.245.48.90', '1'),
(230, 0.000000, 0.000000, '2018-05-15 04:45:24', 21, '21@21.21', '21', '2018051516452484.png', 'TW', 'AD', '173.245.48.90', '1'),
(231, 0.000000, 0.000000, '2018-05-15 04:50:19', 27, 'zhen10427@hotmail.com', '傳遞幸福 感動的時分', '2018051516501925.jpeg', 'TW', 'TW', '172.68.253.110', '0020'),
(232, 23.692471, 120.535156, '2018-05-15 04:51:45', 27, 'multimediar9@gmail.com', 'Helping in need', '201805151651456.jpeg', 'TW', 'TW', '172.68.253.110', '0020'),
(233, 0.000000, 0.000000, '2018-05-15 06:38:07', 22, 'Cindyindy6614@gmail.com', '66666', '', 'TW', 'TW', '172.68.255.5', '0061'),
(234, 0.000000, 0.000000, '2018-05-15 07:00:52', 21, 'ylsh010606@gmail.com', '今天老師幫我簽同意書', '', 'TW', 'TW', '172.69.22.155', '0025'),
(235, 0.000000, 0.000000, '2018-05-15 08:30:50', 54, 'jaw.report@gmail.com', '受到玟慧老師邀請參加傳善活動，開啟正向❤️循環，希望這個由我開始的「代幣」能延續綿長的傳善之旅！', '2018051520305025.jpeg', 'TW', 'TW', '162.158.58.102', '0043'),
(242, 23.694214, 120.533180, '2018-05-16 05:41:53', 23, 'elke0727@gmail.com', '宇琛幫我約到一個聚會，告訴我很多老朋友的近況', '2018051617415351.jpg', 'TW', 'TW', '172.68.255.41', '0012'),
(243, 0.000000, 0.000000, '2018-05-16 07:26:22', 26, 'amywen0914@gmail.com', '告訴我一些有趣的事，娛樂我！', '2018051619262254.jpg', 'TW', 'TW', '172.68.254.171', '0012'),
(244, 23.693962, 120.532639, '2018-05-16 07:39:34', 23, 'dog2238749@gmail.com', '教我抽樣法', '2018051619393460.jpg', 'TW', 'TW', '172.68.253.110', '0012'),
(245, 0.000000, 0.000000, '2018-05-16 08:01:51', 24, 'she8348@yahoo.com.tw', '我要開始參加傳善計畫，散播幸福傳播愛', '', 'TW', 'TW', '162.158.178.36', '0039'),
(246, 0.000000, 0.000000, '2018-05-16 08:01:59', 26, 'm10522223@gemail.yuntech.edu.tw', '我要參加傳善計畫', '', 'TW', 'TW', '162.158.179.229', '0041'),
(247, 0.000000, 0.000000, '2018-05-16 08:03:22', 24, 'M10522213@gemail.yuntech.edu.tw', '拿到GIFT KARMA代幣，感覺真棒！', '201805162003224.jpg', 'TW', 'TW', '172.68.253.152', '0052'),
(248, 0.000000, 0.000000, '2018-05-16 08:03:32', 26, 'm10522223@gemail.yuntech.edu.tw', '我願意參加傳善計畫', '2018051620033253.jpg', 'EN', 'TW', '162.158.179.229', '0041'),
(249, 0.000000, 0.000000, '2018-05-16 08:03:46', 24, 'she8348@yahoo.com.tw', '我不會跑問卷很想哭，好險最後老師有教導了，我好感謝他!', '2018051620034645.jpg', 'TW', 'TW', '162.158.178.36', '0039'),
(250, 0.000000, 0.000000, '2018-05-16 08:03:51', 24, 'she8348@yahoo.com.tw', '我不會跑問卷很想哭，好險最後老師有教導了，我好感謝他!', '2018051620035117.jpg', 'TW', 'TW', '162.158.178.36', '0039'),
(251, 0.000000, 0.000000, '2018-05-16 08:03:55', 24, 'she8348@yahoo.com.tw', '我不會跑問卷很想哭，好險最後老師有教導了，我好感謝他!', '2018051620035511.jpg', 'TW', 'TW', '162.158.178.36', '0039'),
(252, 0.000000, 0.000000, '2018-05-16 08:05:02', 26, 'm10522223@gemail.yuntech.edu.tw', '我願意參加傳善計畫', '2018051620050238.jpg', 'EN', 'TW', '162.158.179.229', '0041'),
(253, 23.693962, 120.532730, '2018-05-16 08:05:56', 46, 'blisschi2004@gmail.com', 'Hello,my dear strangers!', '2018051620055677.jpeg', 'TW', 'TW', '162.158.179.235', '0022'),
(254, 0.000000, 0.000000, '2018-05-16 08:07:22', 26, 'm10522223@gemail.yuntech.edu.tw', '我願意', '2018051620072297.jpg', 'TW', 'TW', '162.158.179.229', '0039'),
(255, 23.693937, 120.532761, '2018-05-16 08:07:36', 24, 'guanjia1016@gmail.com', '幫助同學解決論文問題', '2018051620073675.jpg', 'TW', 'TW', '162.158.179.253', '0041'),
(256, 23.694448, 120.533234, '2018-05-16 08:11:17', 24, 'she8348@gmail.com', '感謝你每天奇裝異服讓我發酵', '', 'TW', 'TW', '162.158.178.36', '0052'),
(257, 0.000000, 0.000000, '2018-05-16 08:14:39', 26, 'susan810327@yahoo.com.tw', '傳善力量大', '2018051620143932.jpg', 'TW', 'TW', '162.158.179.229', '0039'),
(258, 0.000000, 0.000000, '2018-05-16 08:18:48', 26, 'susan810327@yahoo.com.tw', '傳善力量大', '2018051620184831.jpg', 'TW', 'TW', '162.158.179.229', '0039'),
(259, 23.693993, 120.532822, '2018-05-16 08:20:28', 24, 'guanjia1016@gmail.com', '幫助同學解決論文問題～', '2018051620202827.jpg', 'TW', 'TW', '162.158.179.253', '0041'),
(260, 24.972151, 121.205399, '2018-05-19 02:24:21', 23, 'Icery@IceryOfficial.com', '今天在腦殘家，明天要訪談，住這裡比較方便，他好像每天工作都很累，所以一下就睡著了，下禮拜他生日，我還不知道要送他什麼，回去再好好想想吧! (腦殘電腦沒有獨照，只好隨便找一張他最大的:-p)', '2018051902242196.12', 'TW', 'TW', '172.68.255.173', 'Icery'),
(261, 25.003351, 121.432182, '2018-05-19 01:07:44', 23, 'Icery@IceryOfficial.com', '以前常來板車搭火車，可以說是大學最熟的車站了，現在做訪談約在這，不知道下次再來是什麼時候了。', '2018051913074473.jpeg', 'TW', 'TW', '162.158.178.90', 'Icery'),
(262, 24.701565, 120.876160, '2018-05-19 05:30:44', 23, 'Icery@IceryOfficial.com', '訪談結束，搭火車回去，剛經過竹南，一直睡覺已經睡飽了。', '2018051917304460.jpg', 'TW', 'TW', '162.158.178.90', 'Icery'),
(265, 23.692549, 120.535553, '2018-05-23 09:53:41', 26, 'measurement@gmail.com', '改善，從你我開始', '2018052321534151.jpg', 'TW', 'TW', '162.158.58.102', 'testrun01'),
(264, 23.707678, 120.562447, '2018-05-21 09:06:44', 18, 'crazy831116@yahoo.com.tw', '影印中', '201805212106440.jpg', 'TW', 'AF', '162.158.59.211', 'Icery'),
(266, 0.000000, 0.000000, '2018-05-25 05:07:30', 18, 'lazywolfmax@gmail.com', '排隊打球!', '2018052517073051.jpg', 'TW', 'TW', '172.68.254.244', '0141'),
(267, 24.972151, 121.205399, '2018-05-26 01:41:23', 23, 'Icery@IceryOfficial.com', '前天腦殘生日，跟伊婷去釣蝦，昨天跟他吃飯，今天看個展，就跟伊婷一起回斗六了~\r\n\r\nP.S. 伊婷很可愛，現在躺在床上看甄環傳，應該說整天都在看-..-', '2018052601412361.jpg', 'TW', 'TW', '172.68.255.173', 'Icery'),
(268, 0.000000, 0.000000, '2018-05-26 01:49:16', 23, 's1021982@gmail.com', '跟阿瑋到桃園玩一天 昨天還去釣蝦\r\n晚上還去吃牛角\r\n很喜歡這種悠閒的日子\r\n假如沒有論文\r\n就可以更盡興的玩了嗚嗚\r\n照片是在腦殘家住拍的', '2018052601491695.jpg', 'EN', 'TW', '172.69.33.248', 'Annsley'),
(269, 24.970995, 121.254768, '2018-05-26 01:54:13', 23, 's1021982@gmail.com', '阿瑋說他看得到我的日記，媽的勒。\r\n昨天釣蝦只掉到八隻，有個好人跑來送我們一大堆', '2018052601541358.jpg', 'TW', 'AF', '172.69.33.248', 'Annsley'),
(270, 25.014013, 121.464592, '2018-05-26 01:29:30', 23, 'Icery@IceryOfficial.com', '跟伊婷去看展，準備經過鄭傑殺人的江子翠捷運站', '2018052613293049.jpeg', 'TW', 'TW', '162.158.179.223', 'Icery'),
(271, 25.014013, 121.464592, '2018-05-26 01:29:33', 23, 'Icery@IceryOfficial.com', '跟伊婷去看展，準備經過鄭傑殺人的江子翠捷運站', '2018052613293321.jpeg', 'TW', 'TW', '162.158.179.223', 'Icery'),
(272, 0.000000, 0.000000, '2018-05-26 05:35:02', 27, 'zhen10427@hotmail.com', 'Zheng you is a nice guy.\r\nHis work is very quickly.', '2018052617350294.jpg', 'TW', 'TW', '162.158.59.79', '1'),
(273, 0.000000, 0.000000, '2018-05-27 07:49:30', 8, 'lazywolfmax@gmail.com', '將您被幫助的過程記錄下來', '2018052719493084.jpg', 'TW', 'TW', '162.158.178.198', '0125'),
(274, 0.000000, 0.000000, '2018-05-27 08:04:43', 18, 'lazywolfmax@gmail.com', '生日快樂', '2018052720044358.jpg', 'TW', 'TW', '162.158.178.198', '0125'),
(275, 23.691603, 120.537086, '2018-05-27 08:16:33', 18, 'lazywolfmax@gmail.com', '我在凝視著你!', '2018052720163391.jpg', 'TW', 'TW', '162.158.178.198', '0125'),
(276, 23.692492, 120.535545, '2018-05-27 08:18:50', 18, 'lazywolfmax@gmail.com', '純真', '2018052720185094.jpg', 'EN', 'TW', '162.158.178.198', '0125'),
(277, 0.000000, 0.000000, '2018-05-27 08:49:28', 22, 'Cindyindy6614@gmail.com', '台南的花很美', '201805272049281.jpg', 'TW', 'CZ', '162.158.58.84', '0125'),
(278, 0.000000, 0.000000, '2018-05-27 08:55:34', 22, 'Cindyindy6614@gmail.com', '嗷嗷嗷嗷嗷跟我傳教', '201805272055349.jpg', 'TW', 'TR', '162.158.58.84', '0125'),
(279, 0.000000, 0.000000, '2018-05-27 08:59:25', 24, 'caturkey123@gmail.com', '測試無極限~~~', '2018052720592510.jpg', 'TW', 'TW', '172.68.46.92', '0125'),
(280, 0.000000, 0.000000, '2018-05-27 09:02:11', 22, 'Cindyindy6614@gmail.com', 'I helped the ugly man', '2018052721021180.jpg', 'TW', 'BR', '162.158.58.84', '0125'),
(281, 0.000000, 0.000000, '2018-05-27 09:07:01', 27, 'zhen10427@hotmail.com', 'Today I fed a puppy.', '2018052721070189.jpeg', 'TW', 'IS', '162.158.59.79', '1'),
(282, 23.692419, 120.535118, '2018-05-28 03:39:46', 16, 'gk@gmail.com', 'gk 001', '', 'EN', 'TW', '162.158.59.79', '1'),
(283, 23.716219, 120.424240, '2018-05-30 04:46:44', 123, 'b831003ge@gmail.com', '123', '', 'TW', 'TW', '162.158.58.108', 'mailtest01'),
(284, 23.716219, 120.424240, '2018-05-30 04:47:06', 321, 'yuntechimdr@gmail.com', '321', '', 'TW', 'AL', '162.158.58.108', 'mailtest01'),
(285, 23.716219, 120.424240, '2018-05-30 05:27:03', 0, 'mailtest02@123.456', 'test02', '', 'TW', 'AF', '162.158.58.108', 'mailtest02'),
(286, 23.716219, 120.424240, '2018-05-30 05:27:29', 11, 'mailtest@465.123', 'test02', '', 'TW', 'AI', '162.158.58.108', 'mailtest02'),
(287, 23.707678, 120.562447, '2018-05-30 07:01:14', 12, 'zhen10427@hotmail.com', 'tjp65p ', '2018053019011442.JPG', 'TW', 'AF', '162.158.58.102', 'mailtest01'),
(288, 23.707678, 120.562447, '2018-06-04 02:15:10', 123, 'b831003ge@gmail.com', 'b8ASDASDSADSAe@gmail.com', '', 'TW', 'AF', '162.158.59.67', '123'),
(289, 23.707678, 120.562447, '2018-06-04 02:16:15', 10, 'b831003ge@gmail.com', 'ail.com', '', 'TW', 'AF', '162.158.59.67', '456'),
(290, 0.000000, 0.000000, '2018-06-06 12:05:09', 11, 'avy60263xv@gmail.com', '11', '', 'TW', 'AF', '127.0.0.1', '777'),
(291, 23.707678, 120.562447, '2018-06-07 12:04:45', 11, 'b831003ge@gmail.com', 'last', '2018060700044532.jpg', 'TW', 'AF', '172.68.46.224', '123'),
(292, 23.692604, 120.535530, '2018-06-07 09:54:01', 62, 'janeelewis@gmail.com', 'gk role play', '', 'EN', 'US', '108.162.215.121', '0161'),
(293, 23.692579, 120.535530, '2018-06-07 10:06:28', 62, 'janeelewis@gmail.com', 'gk role play', '', 'EN', 'US', '108.162.215.121', '0161'),
(294, 0.000000, 0.000000, '2018-06-07 10:18:57', 62, 'Janeelewis@gmail.com', 'Test 2', '201806071018576.jpg', 'TW', 'US', '172.68.47.165', '0161'),
(295, 23.692007, 120.535507, '2018-06-07 10:19:01', 16, 'Ajdjfj@usus.tw', '', '2018060710190135.jpg', 'TW', 'AF', '172.68.47.9', '0161'),
(296, 23.692007, 120.535507, '2018-06-07 10:19:03', 16, 'Ajdjfj@usus.tw', '', '2018060710190373.jpg', 'TW', 'AF', '172.68.47.9', '0161'),
(297, 0.000000, 0.000000, '2018-06-07 11:29:24', 52, 'Cristance@gmail.com', 'Jane 早上發現我好像顯得很疲倦，所以她協助我用了幾分鐘的時間協助解除身體的疼痛。所以後來疼痛的情況改善了然後覺得很開心因為自己是被照顧的。', '2018060711292436.jpg', 'TW', 'TW', '172.68.253.86', '0091'),
(298, 23.707678, 120.562447, '2018-06-08 04:54:19', 87, 'Icery@IceryOfficial.com', '這是最後一筆資料-180608/04:54', '2018060804541962.png', 'TW', 'TW', '172.68.46.140', '123'),
(299, 23.707678, 120.562447, '2018-06-13 06:26:08', 87, 'b831003ge@gmail.com', '180613-06:25', '2018061306260859.jpg', 'TW', 'BD', '162.158.58.216', '123'),
(300, 0.000000, 0.000000, '2018-06-15 11:48:01', 58, 'bc.yang@sinyi.com.tw', '謝謝一大早從雲林趕上來配合我的時間聚會，讓很多議題可以一起討論完成！', '2018061511480174.jpg', 'TW', 'TW', '172.68.47.243', '0076'),
(301, 0.000000, 0.000000, '2018-06-15 11:48:14', 58, 'bc.yang@sinyi.com.tw', '謝謝一大早從雲林趕上來配合我的時間聚會，讓很多議題可以一起討論完成！', '2018061511481456.jpg', 'TW', 'TW', '172.68.47.243', '0076'),
(302, 0.000000, 0.000000, '2018-06-15 11:48:30', 58, 'bc.yang@sinyi.com.tw', '謝謝一大早從雲林趕上來配合我的時間聚會，讓很多議題可以一起討論完成！', '2018061511483054.jpg', 'TW', 'TW', '172.68.47.243', '0076'),
(303, 22.991323, 120.204796, '2018-06-18 04:42:07', 40, 'chialing.studio@gmail.com', '我看到朋友有一枚硬幣，我很好奇的請她告訴我這是什麼？她說這是有關傳遞善意的一個計畫，為了幫人們提高注意力在日常生活中友善的行為。她問我：你記不記得我曾經幫你做了什麼好事？\r\n我說：有的！\r\n她問我：有興趣進入這個過程嗎？我說好！於是，我獲得了這枚硬幣。', '2018061816420763.jpg', 'TW', 'TW', '172.68.211.175', '0163'),
(304, 22.991323, 120.204796, '2018-06-18 04:42:08', 40, 'chialing.studio@gmail.com', '我看到朋友有一枚硬幣，我很好奇的請她告訴我這是什麼？她說這是有關傳遞善意的一個計畫，為了幫人們提高注意力在日常生活中友善的行為。她問我：你記不記得我曾經幫你做了什麼好事？\r\n我說：有的！\r\n她問我：有興趣進入這個過程嗎？我說好！於是，我獲得了這枚硬幣。', '2018061816420880.jpg', 'TW', 'TW', '172.68.211.175', '0163'),
(305, 0.000000, 0.000000, '2018-06-20 09:39:21', 30, 'emilyko106@gmail.com', '當我腦袋不清晰的時候，有了一個很棒的心靈老師。', '2018062021392189.JPG', 'TW', 'TW', '162.158.58.180', '0091'),
(306, 0.000000, 0.000000, '2018-06-20 09:39:29', 30, 'emilyko106@gmail.com', '當我腦袋不清晰的時候，有了一個很棒的心靈老師。', '2018062021392937.JPG', 'TW', 'TW', '162.158.58.180', '0091'),
(307, 0.000000, 0.000000, '2018-06-21 03:28:03', 19, 'yoyolove000123@gmail.com', '感謝慧芸老師的用心讓我們在課堂上學習到很多人生道理以及知識，還請同學一起去家裡吃飯，很喜歡她!', '201806211528036.jpg', 'TW', 'TW', '162.158.178.48', '0080'),
(308, 39.485741, -0.373072, '2018-06-21 11:49:23', 44, 'b831003ge@gmail.com', '180621 D', '', 'TW', 'AF', '162.158.93.12', '123'),
(309, 23.694841, 120.530457, '2018-06-23 09:07:05', 22, 'leo103108@gmail.com', '很棒', '', 'TW', 'TW', '162.158.179.145', '0085'),
(310, 52.632721, -0.550550, '2018-06-29 04:35:20', 66, 'adam@susted.org.uk', 'I received a lovely cup of cha (TEA) from oneway.', '', 'EN', 'GB', '141.101.99.140', '0129'),
(311, 52.632721, -0.550550, '2018-06-29 04:38:02', 66, 'adam@susted.org.uk', 'Oneway gave me lovely cup of tea.', '2018062904380246.jpg', 'EN', 'GB', '141.101.99.140', '0129'),
(312, 40.412380, -3.697527, '2018-07-03 06:15:16', 424, 'ttt@mgr.rr', 'rehrehh', '', 'EN', 'AF', '172.68.94.115', '1'),
(313, 0.000000, 0.000000, '2018-07-26 07:37:48', 35, 'Jorgeivanvalencia@hotmail.com', 'Gracias謝謝', '2018072619374812.jpeg', 'EN', 'CO', '162.158.155.209', '0219'),
(314, 43.328110, -3.029176, '2018-07-26 07:52:41', 31, 'Padierniga@hotmail.es', 'hOla', '', 'ES', 'ES', '141.101.98.103', '0240'),
(315, 23.689871, 120.529243, '2018-08-06 12:03:54', 20, 'wendy211222@gmail.com', '曾經被同化而忘記夢想，因為老師的一段話而甦醒省思，\r\n“30歲以前 不是社會主義的是沒良心，30歲以後還是社會主義的是沒腦袋”\r\n“親愛的，人的夢想要很大”\r\n讓我踏出我夢想的第一步，更勇敢做自己想做的，繼續堅持自己的理想！', '2018080600035419.jpg', 'TW', 'TW', '108.162.226.164', '0094'),
(316, 52.363487, 4.888026, '2018-08-14 07:04:43', 27, 'Roberto_tonhazzini@icloud.com', 'Estive em Amsterdam no hostel Hanz Brinker onde conheci esse 4 novos amigos de Taiwan.\r\nDepois de muita conversa, risos e brincadeiras, e ate gravarmos um video , eles nos deram a gift karma e explicaram o projeto sensacional deles!\r\n Jamais esperaria algo assim , são pessoas sensacionais de Taiwan que propagam aquilo que o mundo precisa, amor, felicidades, alegria, e mesmo timidos, com sorrisos cativantes, mesmo timidos rs\r\nMuito obrigado por essa sensação maravilhosa de existirem pessoas boas no mundo como vocês!', '201808140704432.jpg', 'EN', 'BR', '172.69.55.157', '0089'),
(317, 0.000000, 0.000000, '2018-08-14 07:08:08', 27, 'johnmandalves@hotmail.com', 'Nos conhecemos em Amsterdam. 04 novos amigos de Taiwan.\r\nJá estava sendo incrível toda a viagem, mas nesse Hostel (Hans Brinker) realmente surpreendeu. Tanto pelo envolvimento com nossas brincadeiras, minha e do Beto, quanto o projeto que eles me apresentaram.\r\nSobre compartilhar carinho por onde passar.\r\nEle tem muito pouco anos, 24 o mais velho, mas o proposito, espero, que dure a vida inteira.\r\nDe toda Eurotrip foram as pessoas que mais me surpreenderam.\r\nFicaram guardadas em minha memoria para sempre.\r\nBRASIL♥️TAIWAN', '2018081407080884.jpeg', 'EN', 'BR', '172.69.54.150', '0198'),
(318, 25.056870, 121.537331, '2018-09-10 09:47:29', 33, 'richard@userxper.com', 'gk', '2018091021472912.jpg', 'TW', 'TW', '172.68.46.56', '0122'),
(319, 0.000000, 0.000000, '2018-09-13 10:31:19', 21, 'nadine.ber@gmx.de', 'I was visiting Frankfurt with two friends and there were 2 guys (John & Berto) from Brazil in our dorm room in the Hostel. The moment we walked into room we started talking, and we kept chatting for like an hour more. The atmosphere was so nice, it felt like we were already friends after 2 minutes. So over the course of our stay we would always chat in the room and the day that John and Berto checked out, they gave me this Karma token, which I happily accepted! They also gave me a Coke glass they got at McDonalds haha\r\n\r\nI really hope they come back to Germany, so that we can meet up again! I know we could habe been really great friends if we got more time to spend.\r\n\r\nI really hope I can pass this coin on to someone I meet, and spread some good Karma in this world :) ', '201809132231196.jpeg', 'EN', 'DE', '172.68.51.229', '0178'),
(320, 23.801025, 120.459534, '2018-09-15 12:42:48', 27, 'zhen10427@hotmail.com', '今天跟培根一起去寫生，很謝謝他騎機車載我去西螺寫生！', '2018091512424844.png', 'TW', 'TW', '108.162.215.73', '0253'),
(321, 23.801025, 120.459534, '2018-09-15 12:53:00', 23, 'juck95731@gmail.com', '今天寫生來前差點有機會佔到寶可夢道館，但是還是慢了一步，到寫生地方畫完了，打西螺福興宮道館還是被其他隊強佔，人生\r\n培根在斗年跟西螺寶可夢故事.', '2018091512530016.jpg', 'TW', 'TW', '108.162.215.73', '0253'),
(322, 23.801077, 120.459610, '2018-09-15 01:02:36', 27, 'good79boy@hotmail.com', '朋友約我出門寫生，讓長期在家當宅男的我，可以出來曬曬太陽，練練畫技。', '2018091513023694.jpg', 'TW', 'TW', '108.162.215.73', '0258'),
(323, 0.000000, 0.000000, '2018-09-22 07:27:32', 28, 'asxe2689@homail.com', '今天和好久不見的朋友碰面，在言談中她說了她的心事，我很高興能在她迷惑時傾聽她的困難，在幫她想辦法時，她真摯的眼神跟我說謝謝，我很高興能幫到她，這次的交談也解決了困擾我的其他問題...', '', 'TW', 'TW', '108.162.215.199', '0264'),
(324, 0.000000, 0.000000, '2018-09-22 08:18:34', 26, 'St931408st931408@gmail.com', '正妹幫我拿衛生紙', '', 'TW', 'TW', '108.162.215.199', '0312'),
(325, 23.495129, 120.741402, '2018-09-22 11:07:13', 23, 'Cindyindy6614@gmail.com', '載我們上德恩亞那部落的司機，中間還繞了一大圈，花了很多時間，感謝他的耐心！！', '', 'TW', 'TW', '108.162.215.199', '0106'),
(326, 0.000000, 0.000000, '2018-09-23 12:17:34', 21, 'caudy8356745@gmail.com', '姊姊說她最近事情很多，工作很忙，都沒有什麼時間休息，所以我就借花獻佛的把蒸眼睛的眼罩給她，希望讓她能舒服一點！', '', 'TW', 'TW', '172.68.211.115', '0293'),
(327, 0.000000, 0.000000, '2018-09-23 12:23:26', 21, 'caudy8356745@gmail.com', '姊姊說她最近工作很多，每天都很忙，所以我就借花獻佛的將朋友給我的蒸氣眼罩給她，希望能幫助她！', '', 'TW', 'TW', '172.68.46.128', '0293'),
(328, 0.000000, 0.000000, '2018-09-23 12:28:24', 27, 'cindy1071990@gmail.com', '前陣子學習鉤毛線，現在提倡環保就做一個給自己的妹妹用', '2018092300282411.jpeg', 'TW', 'TW', '108.162.215.199', '0301'),
(329, 24.345240, 120.712723, '2018-09-24 07:17:57', 37, 'm0978038951@gmail.com', '今天吳宗憲泡咖啡給我喝~\r\n又送我好幾包咖啡包，感謝您\r\n\r\n', '', 'TW', 'TW', '172.68.211.115', '0227');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `gk`
--
ALTER TABLE `gk`
  ADD PRIMARY KEY (`id`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `gk`
--
ALTER TABLE `gk`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=330;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
